Repository: fanzeyi/ime-switch
Catalog: IMESwitch/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

source: %@ is already used to cycle input sources.
ja: %@ は入力ソースの切り替えに使われています。
zh_hans: %@ 已用于循环切换输入法。
zh_hant: %@ 已用於循環切換輸入法。

source: %lld of %lld
ja: %1$lld / %2$lld
zh_hans: %1$lld / %2$lld
zh_hant: %1$lld / %2$lld

source: All Input Sources
ja: すべての入力ソース
zh_hans: 全部输入法
zh_hant: 全部輸入法

source: Allow Accessibility access
ja: アクセシビリティへのアクセスを許可
zh_hans: 允许辅助功能权限
zh_hant: 允許輔助使用權限

source: Another system shortcut
ja: ほかのシステムショートカット
zh_hans: 另一个系统快捷键
zh_hant: 另一個系統快速鍵

source: Clear Shortcut
ja: ショートカットを消去
zh_hans: 清除快捷键
zh_hant: 清除快速鍵

source: Configure Shortcuts…
ja: ショートカットを設定…
zh_hans: 设置快捷键…
zh_hant: 設定快速鍵…

source: Cycle Through
ja: 切り替え対象
zh_hans: 循环切换范围
zh_hant: 循環切換範圍

source: Done
ja: 完了
zh_hans: 完成
zh_hant: 完成

source: Edit Input Sources…
ja: 入力ソースを編集…
zh_hans: 编辑输入法…
zh_hant: 編輯輸入法…

source: Edit…
ja: 編集…
zh_hans: 编辑…
zh_hant: 編輯…

source: Esc is left for cancelling.
ja: Esc はキャンセルに使われます。
zh_hans: Esc 留作取消。
zh_hant: Esc 留作取消。

source: Hold the modifiers and press the key repeatedly to cycle; add ⇧ to go back.
ja: 修飾キーを押したままキーを繰り返し押すと順に切り替わります。⇧ を加えると逆方向です。
zh_hans: 按住修饰键并重复按下按键以循环切换，加上 ⇧ 反向。
zh_hant: 按住修飾鍵並重複按下按鍵以循環切換，加上 ⇧ 反向。

source: IMESwitch needs it to intercept %@ and to find the text cursor.
ja: %@ を受け取り、テキストカーソルの位置を調べるために必要です。
zh_hans: IMESwitch 需要它来接管 %@，并找到文本光标的位置。
zh_hant: IMESwitch 需要它來接管 %@，並找到文字游標的位置。

source: In Keyboard Shortcuts, turn off: %@
ja: 「キーボードショートカット」で次をオフにしてください：%@
zh_hans: 请在“键盘快捷键”中关闭：%@
zh_hant: 請在「鍵盤快速鍵」中關閉：%@

source: Input Sources
ja: 入力ソース
zh_hans: 输入法
zh_hant: 輸入法

source: Later
ja: 後で
zh_hans: 稍后
zh_hant: 稍後

source: Launch at Login
ja: ログイン時に起動
zh_hans: 登录时启动
zh_hant: 登入時啟動

source: No system shortcut is using %@.
ja: %@ を使っているシステムショートカットはありません。
zh_hans: 没有系统快捷键占用 %@。
zh_hant: 沒有系統快速鍵佔用 %@。

source: Open Keyboard Settings…
ja: キーボード設定を開く…
zh_hans: 打开键盘设置…
zh_hant: 打開鍵盤設定…

source: Open Settings…
ja: 設定を開く…
zh_hans: 打开设置…
zh_hant: 打開設定…

source: Press a shortcut anywhere to switch straight to that input source.
ja: どこでもショートカットを押すと、その入力ソースに直接切り替わります。
zh_hans: 在任意位置按下快捷键，即可直接切换到对应的输入法。
zh_hant: 在任何位置按下快速鍵，即可直接切換到對應的輸入法。

source: Quit IMESwitch
ja: IMESwitch を終了
zh_hans: 退出 IMESwitch
zh_hant: 結束 IMESwitch

source: Record Shortcut
ja: ショートカットを記録
zh_hans: 录制快捷键
zh_hant: 錄製快速鍵

source: Reset to %@
ja: %@ に戻す
zh_hans: 恢复为 %@
zh_hant: 恢復為 %@

source: Select next source in Input menu
ja: 入力メニューの次のソースを選択
zh_hans: 选择输入法菜单中的下一个输入法
zh_hant: 選擇輸入方式選單中的下一個輸入方式

source: Select the previous input source
ja: 前の入力ソースを選択
zh_hans: 选择上一个输入法
zh_hant: 選擇上一個輸入方式

source: Set Up IMESwitch
ja: IMESwitch の設定
zh_hans: 设置 IMESwitch
zh_hant: 設定 IMESwitch

source: Shortcuts
ja: ショートカット
zh_hans: 快捷键
zh_hant: 快速鍵

source: Show Emoji & Symbols
ja: 絵文字と記号を表示
zh_hans: 显示表情与符号
zh_hant: 顯示表情符號與符號

source: Show Spotlight search
ja: Spotlight 検索を表示
zh_hans: 显示聚焦搜索
zh_hant: 顯示 Spotlight 搜尋

source: Switch Input Sources
ja: 入力ソースを切り替える
zh_hans: 切换输入法
zh_hant: 切換輸入法

source: Switcher
ja: スイッチャー
zh_hans: 切换器
zh_hant: 切換器

source: Turn off the system %@ shortcut
ja: システムの %@ ショートカットをオフにする
zh_hans: 关闭系统的 %@ 快捷键
zh_hant: 關閉系統的 %@ 快速鍵

source: Two quick steps and %@ will switch input sources in most-recently-used order.
ja: 2 つの手順で、%@ で最近使った順に入力ソースを切り替えられるようになります。
zh_hans: 只需两步，%@ 就会按最近使用的顺序切换输入法。
zh_hant: 只需兩步，%@ 就會依最近使用的順序切換輸入方式。

source: Type Shortcut…
ja: ショートカットを入力…
zh_hans: 请按快捷键…
zh_hant: 請按快速鍵…

source: Type the new shortcut. Esc cancels, Delete clears.
ja: 新しいショートカットを入力してください。Esc でキャンセル、Delete で消去します。
zh_hans: 请按下新的快捷键。Esc 取消，Delete 清除。
zh_hant: 請按下新的快速鍵。Esc 取消，Delete 清除。

source: Type the new shortcut. Esc cancels, Delete resets to %@.
ja: 新しいショートカットを入力してください。Esc でキャンセル、Delete で %@ に戻します。
zh_hans: 请按下新的快捷键。Esc 取消，Delete 恢复为 %@。
zh_hant: 請按下新的快速鍵。Esc 取消，Delete 恢復為 %@。

source: Use ⌘, ⌃ or ⌥ with the key, or a function key.
ja: ⌘、⌃、⌥ のいずれかと組み合わせるか、ファンクションキーを使ってください。
zh_hans: 请搭配 ⌘、⌃ 或 ⌥ 使用，或使用功能键。
zh_hant: 請搭配 ⌘、⌃ 或 ⌥ 使用，或使用功能鍵。

source: Use ⌘, ⌃ or ⌥ with the key, to hold down while cycling.
ja: 切り替え中に押し続けるため、⌘、⌃、⌥ のいずれかと組み合わせてください。
zh_hans: 请搭配 ⌘、⌃ 或 ⌥ 使用，循环切换时需要按住它。
zh_hant: 請搭配 ⌘、⌃ 或 ⌥ 使用，循環切換時需要按住它。

source: Welcome to IMESwitch
ja: IMESwitch へようこそ
zh_hans: 欢迎使用 IMESwitch
zh_hant: 歡迎使用 IMESwitch

source: macOS already uses this shortcut. Pick another, or turn it off in Keyboard Shortcuts.
ja: このショートカットは macOS で使われています。別のものを選ぶか、「キーボードショートカット」でオフにしてください。
zh_hans: macOS 已占用此快捷键。请换一个，或在“键盘快捷键”中将其关闭。
zh_hant: macOS 已佔用此快速鍵。請換一個，或在「鍵盤快速鍵」中將其關閉。

source: macOS also uses this shortcut, so it may not work.
ja: このショートカットは macOS でも使われているため、動作しない場合があります。
zh_hans: macOS 也在使用此快捷键，可能无法生效。
zh_hant: macOS 也在使用此快速鍵，可能無法生效。

source: macOS uses this shortcut too: %@. Turn it off in Keyboard Shortcuts.
ja: macOS もこのショートカットを使っています：%@。「キーボードショートカット」でオフにしてください。
zh_hans: macOS 也在使用此快捷键：%@。请在“键盘快捷键”中将其关闭。
zh_hant: macOS 也在使用此快速鍵：%@。請在「鍵盤快速鍵」中將其關閉。

source: ⇧ is left for cycling backwards.
ja: ⇧ は逆方向の切り替えに使われます。
zh_hans: ⇧ 留作反向切换。
zh_hant: ⇧ 留作反向切換。

source: ⚠️ Finish Setup…
ja: ⚠️ 設定を完了…
zh_hans: ⚠️ 完成设置…
zh_hant: ⚠️ 完成設定…
